zephyrproject-rtos/zephyr/drivers/dma/dma_esp32_gdma.c
/*
 * Copyright (c) 2022-2026 Espressif Systems (Shanghai) Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT espressif_esp32_gdma

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(dma_esp32_gdma, CONFIG_DMA_LOG_LEVEL);

#include <hal/gdma_hal.h>
#include <hal/gdma_hal_ahb.h>
#if defined(SOC_AXI_GDMA_SUPPORTED)
#include <hal/gdma_hal_axi.h>
#include <hal/ahb_dma_ll.h>
#include <hal/axi_dma_ll.h>
#endif
#include <hal/gdma_channel.h>
#include <hal/gdma_ll.h>
#include <hal/dma_types.h>
#include <hal/gdma_types.h>
#include <zephyr/cache.h>

#include <soc.h>
#include <esp_memory_utils.h>
#include <errno.h>
#include <string.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/util.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_esp32.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/interrupt_controller/intc_esp32.h>
#include <zephyr/pm/policy.h>

#if CONFIG_ESP32_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP && SOC_GDMA_SUPPORT_SLEEP_RETENTION
#define GDMA_SLEEP_RETENTION_ENABLED 1
#else
#define GDMA_SLEEP_RETENTION_ENABLED 0
#endif

#if GDMA_SLEEP_RETENTION_ENABLED
#include <gdma_priv.h>
#include <esp_private/sleep_retention.h>

static esp_err_t gdma_create_sleep_retention_cb(void *arg)
{
	const gdma_retention_desc_t *ctx = (const gdma_retention_desc_t *)arg;

	return sleep_retention_entries_create(ctx->link_list, ctx->link_num,
					      REGDMA_LINK_PRI_GDMA, ctx->module_id);
}
#endif

#define DMA_MAX_CHANNEL GDMA_LL_PAIRS_PER_INST

/*
 * On some SoCs (ESP32-C2, ESP32-C3) RX and TX of a channel pair share a
 * single interrupt source. Detect this from DT by comparing the number of
 * interrupts against the number of channel pairs.
 */
#define DMA_ESP32_SHARED_IRQ (DT_NUM_IRQS(DT_DRV_INST(0)) == DT_INST_PROP(0, dma_channels) / 2)

#if defined(SOC_AXI_GDMA_SUPPORTED)
/*
 * On dual-bus SoCs the hal defines GDMA_LL_*_EVENT_MASK as the AHB variant,
 * but the driver also drives the AXI instance. Redefine them to pick the AXI
 * or AHB variant from the runtime is_axi flag so call sites stay bus-agnostic.
 */
#undef GDMA_LL_RX_EVENT_MASK
#undef GDMA_LL_TX_EVENT_MASK
#define GDMA_LL_RX_EVENT_MASK (data->is_axi ? AXI_DMA_LL_RX_EVENT_MASK : AHB_DMA_LL_RX_EVENT_MASK)
#define GDMA_LL_TX_EVENT_MASK (data->is_axi ? AXI_DMA_LL_TX_EVENT_MASK : AHB_DMA_LL_TX_EVENT_MASK)
#elif !defined(GDMA_LL_RX_EVENT_MASK)
/*
 * Some AHB-only SoCs (e.g. esp32c5) also dropped the generic event-mask
 * macros, exposing only the AHB variant. Fall back to it.
 */
#define GDMA_LL_RX_EVENT_MASK AHB_DMA_LL_RX_EVENT_MASK
#define GDMA_LL_TX_EVENT_MASK AHB_DMA_LL_TX_EVENT_MASK
#endif

static int get_m2m_periph_id(void)
{
	return __builtin_ctz(GDMA_LL_M2M_FREE_PERIPH_ID_MASK);
}

struct dma_esp32_data {
	gdma_hal_context_t hal;
#if defined(SOC_AXI_GDMA_SUPPORTED)
	bool is_axi;
#endif
};

enum dma_channel_dir {
	DMA_RX,
	DMA_TX,
	DMA_UNCONFIGURED
};

struct irq_config {
	uint8_t irq_source;
	uint8_t irq_priority;
	int irq_flags;
};

/*
 * AXI DMA requires 8-byte aligned descriptors (16 bytes each); AHB-only SoCs
 * use 4-byte aligned ones (12 bytes). Use the larger type when AXI is present
 * so it works for both AHB and AXI instances.
 */
#if defined(SOC_AXI_GDMA_SUPPORTED)
typedef dma_descriptor_align8_t esp_dma_desc_t;
#else
typedef dma_descriptor_t esp_dma_desc_t;
#endif

/* CONFIG_DCACHE_LINE_SIZE can be narrower than the line the cache really
 * uses, so take the widest line in this build.
 */
#if defined(CONFIG_DCACHE)
#if defined(CONFIG_ESP32_CACHE_L2_LINE_SIZE)
#define DMA_ESP32_SOC_CACHE_LINE CONFIG_ESP32_CACHE_L2_LINE_SIZE
#elif defined(CONFIG_ESP32S3_DATA_CACHE_LINE_SIZE)
#define DMA_ESP32_SOC_CACHE_LINE CONFIG_ESP32S3_DATA_CACHE_LINE_SIZE
#else
#define DMA_ESP32_SOC_CACHE_LINE 0
#endif
#define DMA_ESP32_CACHE_LINE MAX(CONFIG_DCACHE_LINE_SIZE, DMA_ESP32_SOC_CACHE_LINE)
#endif

struct dma_esp32_channel {
	uint8_t dir;
	uint8_t channel_id;
	int periph_id;
	dma_callback_t cb;
	void *user_data;
	esp_dma_desc_t desc_list[CONFIG_DMA_ESP32_MAX_DESCRIPTOR_NUM];
#if CONFIG_PM
	bool pm_lock_held;
#endif
};

struct dma_esp32_config {
	struct irq_config *irq_config;
	uint8_t irq_size;
	void **irq_handlers;
	uint8_t dma_channel_max;
	uint8_t sram_alignment;
	struct dma_esp32_channel dma_channel[DMA_MAX_CHANNEL * 2];
	const struct device *clock_dev;
	clock_control_subsys_t clock_subsys;
};

/* LL wrappers: dual-bus SoCs have AHB and AXI; others use the unified API. */
#if defined(SOC_AXI_GDMA_SUPPORTED)

static inline bool dma_ll_rx_is_fsm_idle(struct dma_esp32_data *data, int ch)
{
	if (data->is_axi) {
		return axi_dma_ll_rx_is_desc_fsm_idle(data->hal.axi_dma_dev, ch);
	}
	return ahb_dma_ll_rx_is_desc_fsm_idle(data->hal.ahb_dma_dev, ch);
}

static inline bool dma_ll_tx_is_fsm_idle(struct dma_esp32_data *data, int ch)
{
	if (data->is_axi) {
		return axi_dma_ll_tx_is_desc_fsm_idle(data->hal.axi_dma_dev, ch);
	}
	return ahb_dma_ll_tx_is_desc_fsm_idle(data->hal.ahb_dma_dev, ch);
}

static inline intptr_t dma_ll_rx_get_prefetched_desc(struct dma_esp32_data *data, int ch)
{
	if (data->is_axi) {
		return axi_dma_ll_rx_get_prefetched_desc_addr(data->hal.axi_dma_dev, ch);
	}
	return ahb_dma_ll_rx_get_prefetched_desc_addr(data->hal.ahb_dma_dev, ch);
}

static inline intptr_t dma_ll_tx_get_prefetched_desc(struct dma_esp32_data *data, int ch)
{
	if (data->is_axi) {
		return axi_dma_ll_tx_get_prefetched_desc_addr(data->hal.axi_dma_dev, ch);
	}
	return ahb_dma_ll_tx_get_prefetched_desc_addr(data->hal.ahb_dma_dev, ch);
}

static inline intptr_t dma_ll_rx_get_suc_eof_desc(struct dma_esp32_data *data, int ch)
{
	if (data->is_axi) {
		return axi_dma_ll_rx_get_success_eof_desc_addr(data->hal.axi_dma_dev, ch);
	}
	return ahb_dma_ll_rx_get_success_eof_desc_addr(data->hal.ahb_dma_dev, ch);
}

static inline void dma_ll_force_reg_clock(struct dma_esp32_data *data, bool en)
{
	if (data->is_axi) {
		axi_dma_ll_force_enable_reg_clock(data->hal.axi_dma_dev, en);
	} else {
		ahb_dma_ll_force_enable_reg_clock(data->hal.ahb_dma_dev, en);
	}
}

#else /* !SOC_AXI_GDMA_SUPPORTED */

static inline bool dma_ll_rx_is_fsm_idle(struct dma_esp32_data *data, int ch)
{
	return gdma_ll_rx_is_desc_fsm_idle(data->hal.dev, ch);
}

