zephyrproject-rtos/zephyr/drivers/dma/dma_esp32_gdma.c
static inline bool dma_ll_tx_is_fsm_idle(struct dma_esp32_data *data, int ch)
{
	return gdma_ll_tx_is_desc_fsm_idle(data->hal.dev, ch);
}

static inline intptr_t dma_ll_rx_get_prefetched_desc(struct dma_esp32_data *data, int ch)
{
	return gdma_ll_rx_get_prefetched_desc_addr(data->hal.dev, ch);
}

static inline intptr_t dma_ll_tx_get_prefetched_desc(struct dma_esp32_data *data, int ch)
{
	return gdma_ll_tx_get_prefetched_desc_addr(data->hal.dev, ch);
}

static inline intptr_t dma_ll_rx_get_suc_eof_desc(struct dma_esp32_data *data, int ch)
{
	return gdma_ll_rx_get_success_eof_desc_addr(data->hal.dev, ch);
}

static inline void dma_ll_force_reg_clock(struct dma_esp32_data *data, bool en)
{
	gdma_ll_force_enable_reg_clock(data->hal.dev, en);
}

#endif /* SOC_AXI_GDMA_SUPPORTED */

#if CONFIG_PM
static void IRAM_ATTR dma_esp32_pm_policy_state_lock_get(struct dma_esp32_channel *dma_channel_rx)
{
	unsigned int key = irq_lock();

	if (!dma_channel_rx->pm_lock_held) {
		dma_channel_rx->pm_lock_held = true;
		pm_policy_state_all_lock_get();
	}

	irq_unlock(key);
}

static void IRAM_ATTR dma_esp32_pm_policy_state_lock_put(struct dma_esp32_channel *dma_channel_rx)
{
	unsigned int key = irq_lock();

	if (dma_channel_rx->pm_lock_held) {
		dma_channel_rx->pm_lock_held = false;
		pm_policy_state_all_lock_put();
	}

	irq_unlock(key);
}
#endif

/* The GDMA writes dw0.length and dw0.owner back, so the cached copy goes
 * stale. Read them through the non-cacheable alias where the SoC has one,
 * which leaves the CPU-owned fields in the same line alone, and invalidate
 * where it does not.
 */
#if defined(SOC_NON_CACHEABLE_OFFSET_SRAM)
static inline esp_dma_desc_t *dma_esp32_desc_uncached(esp_dma_desc_t *desc)
{
	uintptr_t addr = (uintptr_t)desc;

	if (desc == NULL || addr < SOC_DRAM_LOW || addr >= SOC_DRAM_HIGH) {
		return desc;
	}

	return (esp_dma_desc_t *)(addr + SOC_NON_CACHEABLE_OFFSET_SRAM);
}
#else
static inline esp_dma_desc_t *dma_esp32_desc_uncached(esp_dma_desc_t *desc)
{
	if (desc != NULL) {
		sys_cache_data_invd_range(desc, sizeof(*desc));
	}

	return desc;
}
#endif

/* The successful-EOF register is a latch and keeps its value until the next
 * EOF, so it can still name a descriptor from an earlier configuration. Only
 * trust it inside this channel's own list.
 */
static inline bool dma_esp32_desc_in_list(struct dma_esp32_channel *dma_channel,
					  esp_dma_desc_t *desc)
{
	return desc >= dma_channel->desc_list &&
	       desc < &dma_channel->desc_list[ARRAY_SIZE(dma_channel->desc_list)];
}

/*
 * The descriptor list is owned by the CPU except for dw0.length and dw0.owner,
 * which the GDMA writes back. Walking the list on dw0.size and next is safe
 * without invalidating the descriptors themselves.
 */
static void dma_esp32_cache_flush_data(struct dma_esp32_channel *dma_channel)
{
	esp_dma_desc_t *desc = dma_channel->desc_list;

	for (int i = 0; i < ARRAY_SIZE(dma_channel->desc_list) && desc; ++i) {
		if (desc->buffer && desc->dw0.size) {
			sys_cache_data_flush_range(desc->buffer, desc->dw0.size);
		}
		desc = desc->next;
	}
}

/* Drop the cache over a buffer the GDMA wrote. Callers pass buffers that are
 * not cache-line aligned, so the first and last lines also hold data the CPU
 * owns and keeps writing during the transfer: save those bytes and put them
 * back, or they are lost. Writing the lines back instead would put a stale
 * copy of the buffer on top of the received data.
 */
static void dma_esp32_invd_keep_edges(uint8_t *buf, size_t len)
{
#if defined(CONFIG_DCACHE)
	const size_t line = DMA_ESP32_CACHE_LINE;
	uint8_t head[DMA_ESP32_CACHE_LINE - 1];
	uint8_t tail[DMA_ESP32_CACHE_LINE - 1];
	uintptr_t start = (uintptr_t)buf;
	uintptr_t end = start + len;
	uintptr_t base;
	size_t head_len, tail_len;

	base = ROUND_DOWN(start, line);
	head_len = start - base;
	tail_len = ROUND_UP(end, line) - end;

	if (head_len > 0) {
		memcpy(head, (void *)base, head_len);
	}
	if (tail_len > 0) {
		memcpy(tail, (void *)end, tail_len);
	}

	sys_cache_data_invd_range((void *)base, ROUND_UP(end, line) - base);

	if (head_len > 0) {
		memcpy((void *)base, head, head_len);
	}
	if (tail_len > 0) {
		memcpy((void *)end, tail, tail_len);
	}
#else
	ARG_UNUSED(buf);
	ARG_UNUSED(len);
#endif
}

/* Before a transfer the CPU still owns the buffer: the controller may fill
 * only part of it, and the rest has to read back as the CPU left it. Write
 * the cached copy out and drop it, so memory holds the CPU data and no
 * stale line can later be written over what the controller delivers.
 */
static void dma_esp32_cache_prepare_data(struct dma_esp32_channel *dma_channel)
{
	esp_dma_desc_t *desc = dma_channel->desc_list;

	for (int i = 0; i < ARRAY_SIZE(dma_channel->desc_list) && desc; ++i) {
		if (desc->buffer && desc->dw0.size) {
			sys_cache_data_flush_and_invd_range(desc->buffer, desc->dw0.size);
		}
		desc = desc->next;
	}
}

static void dma_esp32_cache_invd_data(struct dma_esp32_channel *dma_channel)
{
	esp_dma_desc_t *desc = dma_channel->desc_list;

	for (int i = 0; i < ARRAY_SIZE(dma_channel->desc_list) && desc; ++i) {
		if (desc->buffer && desc->dw0.size) {
			dma_esp32_invd_keep_edges(desc->buffer, desc->dw0.size);
		}
		desc = desc->next;
	}
}

static void IRAM_ATTR dma_esp32_isr_handle_rx(const struct device *dev,
					      struct dma_esp32_channel *rx, uint32_t intr_status)
{
	struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;
	int status = -EIO;
	bool pm_unlock = false;

	gdma_hal_clear_intr(&data->hal, rx->channel_id, GDMA_CHANNEL_DIRECTION_RX, intr_status);

	if (intr_status & GDMA_LL_EVENT_RX_SUC_EOF) {
		dma_esp32_cache_invd_data(rx);
		status = DMA_STATUS_COMPLETE;
		pm_unlock = true;
	} else if (intr_status & GDMA_LL_EVENT_RX_DONE) {
		dma_esp32_cache_invd_data(rx);
		status = DMA_STATUS_BLOCK;
#if defined(CONFIG_SOC_SERIES_ESP32S3)
	} else if (intr_status & GDMA_LL_EVENT_RX_WATER_MARK) {
		dma_esp32_cache_invd_data(rx);
		status = DMA_STATUS_BLOCK;
#endif
	} else {
		status = -intr_status;
		pm_unlock = true;
	}

#if CONFIG_PM
	if (pm_unlock) {
		dma_esp32_pm_policy_state_lock_put(rx);
	}
#endif

