zephyrproject-rtos/zephyr/drivers/dma/dma_esp32_gdma.c
	if (rx->cb) {
		rx->cb(dev, rx->user_data, rx->channel_id * 2, status);
	}
}

static void IRAM_ATTR dma_esp32_isr_handle_tx(const struct device *dev,
					      struct dma_esp32_channel *tx, uint32_t intr_status)
{
	struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;

	gdma_hal_clear_intr(&data->hal, tx->channel_id, GDMA_CHANNEL_DIRECTION_TX, intr_status);
	if (tx->cb) {
		intr_status &= ~(GDMA_LL_EVENT_TX_TOTAL_EOF | GDMA_LL_EVENT_TX_DONE |
				 GDMA_LL_EVENT_TX_EOF);

		tx->cb(dev, tx->user_data, tx->channel_id * 2 + 1, -intr_status);
	}
}

#if DMA_ESP32_SHARED_IRQ
static void IRAM_ATTR dma_esp32_isr_handle(const struct device *dev, uint8_t rx_id, uint8_t tx_id)
{
	struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;
	struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;
	struct dma_esp32_channel *dma_channel_rx = &config->dma_channel[rx_id];
	struct dma_esp32_channel *dma_channel_tx = &config->dma_channel[tx_id];
	uint32_t intr_status = 0;

	intr_status = gdma_hal_read_intr_status(&data->hal, dma_channel_rx->channel_id,
						GDMA_CHANNEL_DIRECTION_RX, false);
	if (intr_status) {
		dma_esp32_isr_handle_rx(dev, dma_channel_rx, intr_status);
	}

	intr_status = gdma_hal_read_intr_status(&data->hal, dma_channel_tx->channel_id,
						GDMA_CHANNEL_DIRECTION_TX, false);
	if (intr_status) {
		dma_esp32_isr_handle_tx(dev, dma_channel_tx, intr_status);
	}
}
#endif

static int dma_esp32_config_descriptor(struct dma_esp32_channel *dma_channel,
				       struct dma_block_config *block)
{
	if (!block) {
		LOG_ERR("At least one dma block is required");
		return -EINVAL;
	}

	uint32_t target_address = 0, block_size = 0;
	esp_dma_desc_t *desc_iter = dma_channel->desc_list;

	for (int i = 0; i < ARRAY_SIZE(dma_channel->desc_list); ++i) {
		if (block_size == 0) {
			if (dma_channel->dir == DMA_TX) {
				target_address = block->source_address;
			} else {
				target_address = block->dest_address;
			}

			bool dma_capable = esp_ptr_dma_capable((uint32_t *)target_address);

#if defined(CONFIG_ESP_SPIRAM)
			dma_capable =
				dma_capable || esp_ptr_dma_ext_capable((uint32_t *)target_address);
#endif
#if defined(SOC_DMA_CAN_ACCESS_FLASH)
			/*
			 * On SoCs whose DMA can read flash-mapped memory, a TX
			 * source buffer may live in DROM (e.g. a const buffer).
			 * Flash is read-only, so only allow it for the TX path.
			 */
			if (dma_channel->dir == DMA_TX) {
				dma_capable =
					dma_capable || esp_ptr_in_drom((uint32_t *)target_address);
			}
#endif
			if (!dma_capable) {
				if (dma_channel->dir == DMA_TX) {
					LOG_ERR("Tx buffer not in DMA capable memory: %p",
						(uint32_t *)target_address);
				} else {
					LOG_ERR("Rx buffer not in DMA capable memory: %p",
						(uint32_t *)target_address);
				}

				return -EINVAL;
			}

			block_size = block->block_size;

			if (block_size == 0) {
				LOG_ERR("Zero-length DMA block is not allowed");
				return -EINVAL;
			}
		}

		uint32_t buffer_size;

		if (block_size > DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED) {
			buffer_size = DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED;
		} else {
			buffer_size = block_size;
		}

		memset(desc_iter, 0, sizeof(esp_dma_desc_t));
		desc_iter->buffer = (void *)target_address;
		desc_iter->dw0.size = buffer_size;
		if (dma_channel->dir == DMA_TX) {
			desc_iter->dw0.length = buffer_size;
		}
		desc_iter->dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_DMA;

		target_address += buffer_size;
		block_size -= buffer_size;

		if (!block_size) {
			if (block->next_block) {
				block = block->next_block;
			} else {
				desc_iter->next = NULL;
				if (dma_channel->dir == DMA_TX) {
					desc_iter->dw0.suc_eof = 1;
				}
				break;
			}
		}

		desc_iter->next = desc_iter + 1;
		desc_iter += 1;
	}

	if (desc_iter == dma_channel->desc_list + ARRAY_SIZE(dma_channel->desc_list)) {
		memset(dma_channel->desc_list, 0, sizeof(dma_channel->desc_list));
		LOG_ERR("Run out of DMA descriptors. Increase CONFIG_DMA_ESP32_MAX_DESCRIPTOR_NUM");
		return -EINVAL;
	}

	/* Write back cache so the GDMA hardware sees fresh descriptor values.
	 * No-op when CACHE_MANAGEMENT is disabled (SoCs without a data cache).
	 */
	sys_cache_data_flush_range(dma_channel->desc_list, sizeof(dma_channel->desc_list));

	if (dma_channel->dir == DMA_TX) {
		dma_esp32_cache_flush_data(dma_channel);
	} else {
		dma_esp32_cache_prepare_data(dma_channel);
	}

	return 0;
}

static void dma_esp32_channel_reset(struct dma_esp32_data *data, uint32_t channel_id,
				    gdma_channel_direction_t dir)
{
#if defined(SOC_AXI_GDMA_SUPPORTED)
	if (data->is_axi) {
		/* An AXI transfer cannot be reset while it is still in flight. */
		if (dir == GDMA_CHANNEL_DIRECTION_RX) {
			axi_dma_ll_rx_abort(data->hal.axi_dma_dev, channel_id, true);
			while (!axi_dma_ll_rx_is_reset_avail(data->hal.axi_dma_dev, channel_id)) {
			}
			axi_dma_ll_rx_reset_channel(data->hal.axi_dma_dev, channel_id);
			axi_dma_ll_rx_abort(data->hal.axi_dma_dev, channel_id, false);
		} else {
			axi_dma_ll_tx_abort(data->hal.axi_dma_dev, channel_id, true);
			while (!axi_dma_ll_tx_is_reset_avail(data->hal.axi_dma_dev, channel_id)) {
			}
			axi_dma_ll_tx_reset_channel(data->hal.axi_dma_dev, channel_id);
			axi_dma_ll_tx_abort(data->hal.axi_dma_dev, channel_id, false);
		}

		return;
	}
#endif /* SOC_AXI_GDMA_SUPPORTED */

	gdma_hal_reset(&data->hal, channel_id, dir);
}

static void dma_esp32_stop_barrier(struct dma_esp32_data *data, uint32_t channel_id,
				   gdma_channel_direction_t dir)
{
	uint32_t mask = GDMA_LL_TX_EVENT_MASK;

	if (dir == GDMA_CHANNEL_DIRECTION_RX) {
		mask = GDMA_LL_RX_EVENT_MASK;
	}

	dma_esp32_channel_reset(data, channel_id, dir);

	/* Reset leaves events the abandoned transfer already latched. */
	gdma_hal_clear_intr(&data->hal, channel_id, dir, mask);
}

static int dma_esp32_config_rx(const struct device *dev, struct dma_esp32_channel *dma_channel,
			       struct dma_config *config_dma)
{
	struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;
	struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;

	dma_channel->dir = DMA_RX;

	dma_esp32_channel_reset(data, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX);

