zephyrproject-rtos/zephyr/drivers/dma/dma_esp32_gdma.c
	if (dma_channel->periph_id == SOC_GDMA_TRIG_PERIPH_M2M0) {
		gdma_hal_connect_mem(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX,
				     get_m2m_periph_id());
	} else {
		gdma_hal_connect_peri(&data->hal, dma_channel->channel_id,
				      GDMA_CHANNEL_DIRECTION_RX, dma_channel->periph_id);
	}

	if (config_dma->dest_burst_length) {
		gdma_hal_enable_burst(&data->hal, dma_channel->channel_id,
				      GDMA_CHANNEL_DIRECTION_RX, config->sram_alignment >= 4,
				      config->sram_alignment >= 4);
	}

	gdma_hal_set_strategy(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX, true,
			      false, false);

	dma_channel->cb = config_dma->dma_callback;
	dma_channel->user_data = config_dma->user_data;

	gdma_hal_enable_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX,
			     GDMA_LL_RX_EVENT_MASK, false);

	gdma_hal_clear_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX,
			    GDMA_LL_RX_EVENT_MASK);

	return dma_esp32_config_descriptor(dma_channel, config_dma->head_block);
}

static int dma_esp32_config_tx(const struct device *dev, struct dma_esp32_channel *dma_channel,
			       struct dma_config *config_dma)
{
	struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;

	dma_channel->dir = DMA_TX;

	dma_esp32_channel_reset(data, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX);

	if (dma_channel->periph_id == SOC_GDMA_TRIG_PERIPH_M2M0) {
		gdma_hal_connect_mem(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX,
				     get_m2m_periph_id());
	} else {
		gdma_hal_connect_peri(&data->hal, dma_channel->channel_id,
				      GDMA_CHANNEL_DIRECTION_TX, dma_channel->periph_id);
	}

	if (config_dma->source_burst_length) {
		gdma_hal_enable_burst(&data->hal, dma_channel->channel_id,
				      GDMA_CHANNEL_DIRECTION_TX, true, true);
	}

	dma_channel->cb = config_dma->dma_callback;
	dma_channel->user_data = config_dma->user_data;

	gdma_hal_enable_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX,
			     GDMA_LL_TX_EVENT_MASK, false);

	gdma_hal_clear_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX,
			    GDMA_LL_TX_EVENT_MASK);

	return dma_esp32_config_descriptor(dma_channel, config_dma->head_block);
}

static int dma_esp32_config(const struct device *dev, uint32_t channel,
			    struct dma_config *config_dma)
{
	struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;
	struct dma_esp32_channel *dma_channel;
	int ret = 0;

	if (channel >= config->dma_channel_max) {
		LOG_ERR("Unsupported channel");
		return -EINVAL;
	}

	dma_channel = &config->dma_channel[channel];

	if (!config_dma) {
		return -EINVAL;
	}

	if (config_dma->source_burst_length != config_dma->dest_burst_length) {
		LOG_ERR("Source and destination burst lengths must be equal");
		return -EINVAL;
	}

	dma_channel->periph_id = config_dma->channel_direction == MEMORY_TO_MEMORY
					 ? SOC_GDMA_TRIG_PERIPH_M2M0
					 : config_dma->dma_slot;

	dma_channel->channel_id = channel / 2;

	switch (config_dma->channel_direction) {
	case MEMORY_TO_MEMORY:
		struct dma_esp32_channel *dma_channel_rx =
			&config->dma_channel[dma_channel->channel_id * 2];
		struct dma_esp32_channel *dma_channel_tx =
			&config->dma_channel[(dma_channel->channel_id * 2) + 1];

		dma_channel_rx->channel_id = dma_channel->channel_id;
		dma_channel_tx->channel_id = dma_channel->channel_id;

		dma_channel_rx->periph_id = dma_channel->periph_id;
		dma_channel_tx->periph_id = dma_channel->periph_id;

		ret = dma_esp32_config_rx(dev, dma_channel_rx, config_dma);
		if (ret < 0) {
			break;
		}
		ret = dma_esp32_config_tx(dev, dma_channel_tx, config_dma);
		break;
	case PERIPHERAL_TO_MEMORY:
		ret = dma_esp32_config_rx(dev, dma_channel, config_dma);
		break;
	case MEMORY_TO_PERIPHERAL:
		ret = dma_esp32_config_tx(dev, dma_channel, config_dma);
		break;
	default:
		LOG_ERR("Invalid Channel direction");
		return -EINVAL;
	}

	return ret;
}

static int dma_esp32_start(const struct device *dev, uint32_t channel)
{
	struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;
	struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;
	struct dma_esp32_channel *dma_channel;

	if (channel >= config->dma_channel_max) {
		LOG_ERR("Unsupported channel");
		return -EINVAL;
	}

	dma_channel = &config->dma_channel[channel];

	if (dma_channel->periph_id == SOC_GDMA_TRIG_PERIPH_M2M0) {
		struct dma_esp32_channel *dma_channel_rx =
			&config->dma_channel[dma_channel->channel_id * 2];
		struct dma_esp32_channel *dma_channel_tx =
			&config->dma_channel[(dma_channel->channel_id * 2) + 1];

#if CONFIG_PM
		dma_esp32_pm_policy_state_lock_get(dma_channel_rx);
#endif
		gdma_hal_enable_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX,
				     GDMA_LL_EVENT_RX_SUC_EOF | GDMA_LL_EVENT_RX_DONE, true);
		gdma_hal_enable_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX,
				     GDMA_LL_EVENT_TX_EOF, true);

		gdma_hal_start_with_desc(&data->hal, dma_channel->channel_id,
					 GDMA_CHANNEL_DIRECTION_RX,
					 (intptr_t)dma_channel_rx->desc_list);
		gdma_hal_start_with_desc(&data->hal, dma_channel->channel_id,
					 GDMA_CHANNEL_DIRECTION_TX,
					 (intptr_t)dma_channel_tx->desc_list);
	} else {
		if (dma_channel->dir == DMA_RX) {
			gdma_hal_enable_intr(
				&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX,
				GDMA_LL_EVENT_RX_SUC_EOF | GDMA_LL_EVENT_RX_DONE, true);
			gdma_hal_start_with_desc(&data->hal, dma_channel->channel_id,
						 GDMA_CHANNEL_DIRECTION_RX,
						 (intptr_t)dma_channel->desc_list);
		} else if (dma_channel->dir == DMA_TX) {
			gdma_hal_enable_intr(&data->hal, dma_channel->channel_id,
					     GDMA_CHANNEL_DIRECTION_TX, GDMA_LL_EVENT_TX_EOF, true);
			gdma_hal_start_with_desc(&data->hal, dma_channel->channel_id,
						 GDMA_CHANNEL_DIRECTION_TX,
						 (intptr_t)dma_channel->desc_list);
		} else {
			LOG_ERR("Channel %d is not configured", channel);
			return -EINVAL;
		}
	}

