zephyrproject-rtos/zephyr/drivers/dma/dma_esp32_gdma.c
	return 0;
}

static int dma_esp32_stop(const struct device *dev, uint32_t channel)
{
	struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;
	struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;
	struct dma_esp32_channel *dma_channel;

	if (channel >= config->dma_channel_max) {
		LOG_ERR("Unsupported channel");
		return -EINVAL;
	}

	dma_channel = &config->dma_channel[channel];

	if (dma_channel->periph_id == SOC_GDMA_TRIG_PERIPH_M2M0) {
		gdma_hal_enable_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX,
				     GDMA_LL_RX_EVENT_MASK, false);
		gdma_hal_enable_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX,
				     GDMA_LL_TX_EVENT_MASK, false);
		gdma_hal_stop(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX);
		gdma_hal_stop(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX);
		dma_esp32_stop_barrier(data, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX);
		dma_esp32_stop_barrier(data, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX);
#if CONFIG_PM
		struct dma_esp32_channel *dma_channel_rx =
			&config->dma_channel[dma_channel->channel_id * 2];

		dma_esp32_pm_policy_state_lock_put(dma_channel_rx);
#endif
	} else if (dma_channel->dir == DMA_RX) {
		gdma_hal_enable_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX,
				     GDMA_LL_RX_EVENT_MASK, false);
		gdma_hal_stop(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX);
		dma_esp32_stop_barrier(data, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX);
	} else if (dma_channel->dir == DMA_TX) {
		gdma_hal_enable_intr(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX,
				     GDMA_LL_TX_EVENT_MASK, false);
		gdma_hal_stop(&data->hal, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX);
		dma_esp32_stop_barrier(data, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX);
	}

	return 0;
}

/* Callable from a DMA callback, so it has to stay reachable with flash
 * unmapped: no logging here.
 */
static int IRAM_ATTR dma_esp32_get_status(const struct device *dev, uint32_t channel,
					  struct dma_status *status)
{
	struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;
	struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;
	struct dma_esp32_channel *dma_channel;
	esp_dma_desc_t *desc;

	if (channel >= config->dma_channel_max) {
		return -EINVAL;
	}

	dma_channel = &config->dma_channel[channel];

	if (status == NULL) {
		return -EINVAL;
	}

	memset(status, 0, sizeof(struct dma_status));

	if (dma_channel->dir == DMA_RX) {
		status->busy = !dma_ll_rx_is_fsm_idle(data, dma_channel->channel_id);
		status->dir = PERIPHERAL_TO_MEMORY;
		desc = (esp_dma_desc_t *)dma_ll_rx_get_prefetched_desc(data,
								       dma_channel->channel_id);
		if (desc == NULL) {
			/* Not every controller keeps the prefetched descriptor
			 * readable once the transfer has ended; the AHB
			 * instance on esp32p4 reports zero there. The
			 * successful-EOF register still points at the last
			 * descriptor written back, so use it instead.
			 *
			 * That register is a latch and survives a rearm, so
			 * only take it while the descriptor it names has been
			 * handed back by the controller.
			 */
			desc = (esp_dma_desc_t *)dma_ll_rx_get_suc_eof_desc(
				data, dma_channel->channel_id);

			if (dma_esp32_desc_in_list(dma_channel, desc) &&
			    dma_esp32_desc_uncached(desc)->dw0.owner ==
				    DMA_DESCRIPTOR_BUFFER_OWNER_DMA) {
				desc = NULL;
			}
		}

		if (dma_esp32_desc_in_list(dma_channel, desc)) {
			esp_dma_desc_t *desc_nc = dma_esp32_desc_uncached(desc);

			status->read_position = desc - dma_channel->desc_list;
			status->total_copied =
				desc_nc->dw0.length +
				dma_channel->desc_list[0].dw0.size * status->read_position;
		}
	} else if (dma_channel->dir == DMA_TX) {
		status->busy = !dma_ll_tx_is_fsm_idle(data, dma_channel->channel_id);
		status->dir = MEMORY_TO_PERIPHERAL;
		desc = (esp_dma_desc_t *)dma_ll_tx_get_prefetched_desc(data,
								       dma_channel->channel_id);
		if (dma_esp32_desc_in_list(dma_channel, desc)) {
			status->write_position = desc - dma_channel->desc_list;
		}
	}

	return 0;
}

static int dma_esp32_reload(const struct device *dev, uint32_t channel, uint32_t src, uint32_t dst,
			    size_t size)
{
	struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;
	struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;
	struct dma_esp32_channel *dma_channel;
	esp_dma_desc_t *desc_iter;
	uint32_t buf;

	if (channel >= config->dma_channel_max) {
		LOG_ERR("Unsupported channel");
		return -EINVAL;
	}

	dma_channel = &config->dma_channel[channel];
	desc_iter = dma_channel->desc_list;

	if (size == 0) {
		LOG_ERR("Zero-length DMA block is not allowed for a reload");
		return -EINVAL;
	}

	if (size > ARRAY_SIZE(dma_channel->desc_list) *
		   DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED) {
		LOG_ERR("Not enough DMA descriptors. Increase CONFIG_DMA_ESP32_MAX_DESCRIPTOR_NUM");
		return -EINVAL;
	}

	if (dma_channel->dir == DMA_RX) {
		dma_esp32_channel_reset(data, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_RX);
		buf = dst;
	} else if (dma_channel->dir == DMA_TX) {
		dma_esp32_channel_reset(data, dma_channel->channel_id, GDMA_CHANNEL_DIRECTION_TX);
		buf = src;
	} else {
		return -EINVAL;
	}

	for (int i = 0; i < ARRAY_SIZE(dma_channel->desc_list); ++i) {
		memset(desc_iter, 0, sizeof(esp_dma_desc_t));
		desc_iter->buffer = (void *)(buf + DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED * i);
		desc_iter->dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_DMA;
		if (size <= DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED) {
			desc_iter->dw0.size = size;
			if (dma_channel->dir == DMA_TX) {
				desc_iter->dw0.length = size;
				desc_iter->dw0.suc_eof = 1;
			}
			desc_iter->next = NULL;
			break;
		}
		desc_iter->dw0.size = DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED;
		if (dma_channel->dir == DMA_TX) {
			desc_iter->dw0.length = DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED;
		}
		size -= DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED;
		desc_iter->next = desc_iter + 1;
		desc_iter += 1;
	}

	if (desc_iter == dma_channel->desc_list + ARRAY_SIZE(dma_channel->desc_list)) {
		memset(dma_channel->desc_list, 0, sizeof(dma_channel->desc_list));
		LOG_ERR("Not enough DMA descriptors. Increase CONFIG_DMA_ESP32_MAX_DESCRIPTOR_NUM");
		return -EINVAL;
	}

	sys_cache_data_flush_range(dma_channel->desc_list, sizeof(dma_channel->desc_list));

