zephyrproject-rtos/zephyr/drivers/dma/dma_esp32_gdma.c
	if (dma_channel->dir == DMA_TX) {
		dma_esp32_cache_flush_data(dma_channel);
	} else {
		dma_esp32_cache_prepare_data(dma_channel);
	}

	return 0;
}

static int dma_esp32_configure_irq(const struct device *dev)
{
	struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;
	struct dma_esp32_data *data = (struct dma_esp32_data *)dev->data;
	struct irq_config *irq_cfg = (struct irq_config *)config->irq_config;
	volatile uint32_t *status_reg;
	uint32_t status_mask;

	for (uint8_t i = 0; i < config->irq_size; i++) {
#if DMA_ESP32_SHARED_IRQ
		status_reg = gdma_ll_rx_get_interrupt_status_reg(data->hal.dev, i);
		status_mask = (GDMA_LL_RX_EVENT_MASK | GDMA_LL_TX_EVENT_MASK);
#else
		/* We assume device tree to feature RX/TX pairs */
		if (i % 2) {
			status_reg = (volatile uint32_t *)gdma_hal_get_intr_status_reg(
				&data->hal, i / 2, GDMA_CHANNEL_DIRECTION_TX);
			status_mask = GDMA_LL_TX_EVENT_MASK;
		} else {
			status_reg = (volatile uint32_t *)gdma_hal_get_intr_status_reg(
				&data->hal, i / 2, GDMA_CHANNEL_DIRECTION_RX);
			status_mask = GDMA_LL_RX_EVENT_MASK;
		}
#endif

		int ret = esp_intr_alloc_intrstatus(irq_cfg[i].irq_source,
			ESP_PRIO_TO_FLAGS(irq_cfg[i].irq_priority) |
				ESP_INT_FLAGS_CHECK(irq_cfg[i].irq_flags) | ESP_INTR_FLAG_IRAM,
			(uint32_t)status_reg,
			status_mask,
			(intr_handler_t)config->irq_handlers[i],
			(void *)dev,
			NULL);

		if (ret != 0) {
			LOG_ERR("Could not allocate interrupt handler");
			return ret;
		}
	}

	return 0;
}

static int dma_esp32_init(const struct device *dev)
{
	struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;
	struct dma_esp32_data *data = (struct dma_esp32_data *)dev->data;
	struct dma_esp32_channel *dma_channel;
	int ret = 0;

	if (!device_is_ready(config->clock_dev)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	ret = clock_control_on(config->clock_dev, config->clock_subsys);
	if (ret < 0 && ret != -EALREADY) {
		LOG_ERR("Could not initialize clock (%d)", ret);
		return ret;
	}

	for (uint8_t i = 0; i < DMA_MAX_CHANNEL * 2; i++) {
		dma_channel = &config->dma_channel[i];
		dma_channel->cb = NULL;
		dma_channel->dir = DMA_UNCONFIGURED;
		dma_channel->periph_id = ESP_GDMA_TRIG_PERIPH_INVALID;
		memset(dma_channel->desc_list, 0, sizeof(dma_channel->desc_list));
	}

	int group_id;

#if defined(SOC_AXI_GDMA_SUPPORTED)
	/*
	 * Dual-bus SoCs have two gdma instances sharing the same compatible, told
	 * apart by base address: the AXI instance lives at DR_REG_AXI_DMA_BASE,
	 * the AHB instance does not. The hal init picks the matching register base.
	 */
	if ((uint32_t)data->hal.dev == DR_REG_AXI_DMA_BASE) {
		gdma_ll_enable_bus_clock(1, true);
		gdma_ll_reset_register(1);
		group_id = GDMA_LL_AXI_GROUP_START_ID;
		gdma_hal_config_t hal_config = {
			.group_id = group_id,
		};
		gdma_axi_hal_init(&data->hal, &hal_config);
		data->is_axi = true;
	} else {
		group_id = GDMA_LL_AHB_GROUP_START_ID;
		gdma_hal_config_t hal_config = {
			.group_id = group_id,
		};
		gdma_ahb_hal_init(&data->hal, &hal_config);
		data->is_axi = false;
	}
#else
	group_id = GDMA_LL_AHB_GROUP_START_ID;
	gdma_hal_config_t hal_config = {
		.group_id = group_id,
	};
	gdma_ahb_hal_init(&data->hal, &hal_config);
#endif
	dma_ll_force_reg_clock(data, true);

	ret = dma_esp32_configure_irq(dev);
	if (ret < 0) {
		LOG_ERR("Could not configure IRQ (%d)", ret);
		return ret;
	}

#if GDMA_SLEEP_RETENTION_ENABLED
	for (uint8_t pair = 0; pair < GDMA_LL_PAIRS_PER_INST; pair++) {
		const gdma_retention_desc_t *ctx =
			&gdma_retention_infos[group_id][pair];
		sleep_retention_module_init_param_t init_param = {
			.cbs = {.create = {.handle = gdma_create_sleep_retention_cb,
					   .arg = (void *)ctx}},
			.attribute = SLEEP_RETENTION_MODULE_ATTR_ATTACH,
			.depends = RETENTION_MODULE_BITMAP_INIT(CLOCK_SYSTEM),
		};
		esp_err_t err = sleep_retention_module_init(ctx->module_id, &init_param);

		if (err == ESP_OK) {
			err = sleep_retention_module_allocate(ctx->module_id);
		}
		if (err == ESP_OK) {
			err = sleep_retention_module_attach(ctx->module_id);
		}
		if (err != ESP_OK) {
			LOG_WRN("Failed to init GDMA sleep retention for pair %d", pair);
		}
	}
#endif

	return 0;
}

static DEVICE_API(dma, dma_esp32_api) = {
	.config = dma_esp32_config,
	.start = dma_esp32_start,
	.stop = dma_esp32_stop,
	.get_status = dma_esp32_get_status,
	.reload = dma_esp32_reload,
};

#if DMA_ESP32_SHARED_IRQ

#define DMA_ESP32_DEFINE_IRQ_HANDLER(channel)                                                      \
	__attribute__((unused)) static void IRAM_ATTR dma_esp32_isr_##channel(                     \
		const struct device *dev)                                                          \
	{                                                                                          \
		dma_esp32_isr_handle(dev, channel * 2, channel * 2 + 1);                           \
	}

#else

#define DMA_ESP32_DEFINE_IRQ_HANDLER(channel)                                                      \
	__attribute__((unused)) static void IRAM_ATTR dma_esp32_isr_##channel##_rx(                \
		const struct device *dev)                                                          \
	{                                                                                          \
		struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;          \
		struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;           \
		uint32_t intr_status = gdma_hal_read_intr_status(                                  \
			&data->hal, channel, GDMA_CHANNEL_DIRECTION_RX, false);                    \
		if (intr_status) {                                                                 \
			dma_esp32_isr_handle_rx(dev, &config->dma_channel[channel * 2],            \
						intr_status);                                      \
		}                                                                                  \
	}                                                                                          \
                                                                                                   \
	__attribute__((unused)) static void IRAM_ATTR dma_esp32_isr_##channel##_tx(                \
		const struct device *dev)                                                          \
	{                                                                                          \
		struct dma_esp32_config *config = (struct dma_esp32_config *)dev->config;          \
		struct dma_esp32_data *data = (struct dma_esp32_data *const)(dev)->data;           \
		uint32_t intr_status = gdma_hal_read_intr_status(                                  \
			&data->hal, channel, GDMA_CHANNEL_DIRECTION_TX, false);                    \
		if (intr_status) {                                                                 \
			dma_esp32_isr_handle_tx(dev, &config->dma_channel[channel * 2 + 1],        \
						intr_status);                                      \
		}                                                                                  \
	}

#endif

#if DMA_ESP32_SHARED_IRQ
#define ESP32_DMA_HANDLER(channel) dma_esp32_isr_##channel
#else
#define ESP32_DMA_HANDLER(channel) dma_esp32_isr_##channel##_rx, dma_esp32_isr_##channel##_tx
#endif

