zephyrproject-rtos/zephyr/drivers/dma/dma_esp32_gdma.c
DMA_ESP32_DEFINE_IRQ_HANDLER(0)
#if DMA_MAX_CHANNEL >= 2
DMA_ESP32_DEFINE_IRQ_HANDLER(1)
#endif
#if DMA_MAX_CHANNEL >= 3
DMA_ESP32_DEFINE_IRQ_HANDLER(2)
#endif
#if DMA_MAX_CHANNEL >= 4
DMA_ESP32_DEFINE_IRQ_HANDLER(3)
#endif
#if DMA_MAX_CHANNEL >= 5
DMA_ESP32_DEFINE_IRQ_HANDLER(4)
#endif

static void *irq_handlers[] = {
	ESP32_DMA_HANDLER(0),
#if DMA_MAX_CHANNEL >= 2
	ESP32_DMA_HANDLER(1),
#endif
#if DMA_MAX_CHANNEL >= 3
	ESP32_DMA_HANDLER(2),
#endif
#if DMA_MAX_CHANNEL >= 4
	ESP32_DMA_HANDLER(3),
#endif
#if DMA_MAX_CHANNEL >= 5
	ESP32_DMA_HANDLER(4),
#endif
};

#define IRQ_NUM(idx) DT_NUM_IRQS(DT_DRV_INST(idx))
#define IRQ_ENTRY(n, idx)                                                                          \
	{DT_INST_IRQ_BY_IDX(idx, n, irq), DT_INST_IRQ_BY_IDX(idx, n, priority),                    \
	 DT_INST_IRQ_BY_IDX(idx, n, flags)},

/* clang-format off */
#define DMA_ESP32_INIT(idx)                                                  \
	static struct irq_config irq_config_##idx[] = {                      \
		LISTIFY(IRQ_NUM(idx), IRQ_ENTRY, (), idx)                    \
	};                                                                   \
	static struct dma_esp32_config dma_config_##idx = {                  \
		.irq_config = irq_config_##idx,                              \
		.irq_size = IRQ_NUM(idx),                                    \
		.irq_handlers = irq_handlers,                                \
		.dma_channel_max = DT_INST_PROP(idx, dma_channels),          \
		.sram_alignment =                                            \
			DT_INST_PROP(idx, dma_buf_addr_alignment),           \
		.clock_dev = DEVICE_DT_GET(DT_INST_CLOCKS_CTLR(idx)),       \
		.clock_subsys =                                              \
			(void *)DT_INST_CLOCKS_CELL(idx, offset),            \
	};                                                                   \
	static struct dma_esp32_data dma_data_##idx = {                      \
		.hal = {                                                     \
			.dev = (void *)DT_INST_REG_ADDR(idx),                \
		},                                                           \
	};                                                                   \
	DEVICE_DT_INST_DEFINE(idx, dma_esp32_init, NULL,                     \
			      &dma_data_##idx, &dma_config_##idx,            \
			      PRE_KERNEL_1, CONFIG_DMA_INIT_PRIORITY,        \
			      &dma_esp32_api);
/* clang-format on */

DT_INST_FOREACH_STATUS_OKAY(DMA_ESP32_INIT)
